espressif/idf-eclipse-plugin/bundles/com.espressif.idf.debug.gdbjtag.openocd/svd/esp32s2-ulp.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC_CNTL</name>
      <description>Real-Time Clock Control</description>
      <groupName>RTC_CNTL</groupName>
      <baseAddress>0x00008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x138</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RISCV_START_INT</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>SW_INT</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>SWD_INT</name>
        <value>8</value>
      </interrupt>
      <registers>
        <register>
          <name>ULP_CP_TIMER</name>
          <description>Configure coprocessor timer</description>
          <addressOffset>0xF8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ULP_CP_PC_INIT</name>
              <description>ULP coprocessor PC initial address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_GPIO_WAKEUP_ENA</name>
              <description>Enable the option of ULP coprocessor woken up by
RTC GPIO</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_GPIO_WAKEUP_CLR</name>
              <description>Disable the option of ULP coprocessor woken up by
RTC GPIO</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_CP_SLP_TIMER_EN</name>
              <description>ULP coprocessor timer enable bit. 0: Disable hardware
Timer. 1: Enable hardware timer</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_CTRL</name>
          <description>ULP-FSM configuration register</description>
          <addressOffset>0xFC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00100200</resetValue>
          <fields>
            <field>
              <name>ULP_CP_MEM_ADDR_INIT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_MEM_ADDR_SIZE</name>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_MEM_OFFSET_CLR</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ULP_CP_CLK_FO</name>
              <description>ULP-FSM clock force on</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_RESET</name>
              <description>ULP-FSM clock software reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_FORCE_START_TOP</name>
              <description>Write 1 to start ULP-FSM by software</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ULP_CP_START_TOP</name>
              <description>Write 1 to start ULP-FSM</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COCPU_CTRL</name>
          <description>ULP-RISCV configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x008A0810</resetValue>
          <fields>
            <field>
              <name>COCPU_CLK_FO</name>
              <description>ULP-RISCV clock force on</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_START_2_RESET_DIS</name>
              <description>Time from ULP-RISCV startup to pull down reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_START_2_INTR_EN</name>
              <description>Time from ULP-RISCV startup to send out
RISCV_START_INT interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SHUT</name>
              <description>Shut down ULP-RISCV</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SHUT_2_CLK_DIS</name>
              <description>Time from shut down ULP-RISCV to disable clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SHUT_RESET_EN</name>
              <description>This bit is used to reset ULP-RISCV</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SEL</name>
              <description>0: select ULP-RISCV. 1: select ULP-FSM</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_DONE_FORCE</name>
              <description>0: select ULP-FSM DONE signal. 1: select ULP-RISCV DONE
signal</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_DONE</name>
              <description>DONE signal. Write 1 to this bit, ULP-RISCV will go to HALT and the
timer starts counting</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SW_INT_TRIGGER</name>
              <description>Trigger ULP-RISCV register interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ULP_CP_TIMER_1</name>
          <description>Configure sleep cycle of the timer</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000C800</resetValue>
          <fields>
            <field>
              <name>ULP_CP_TIMER_SLP_CYCLE</name>
              <description>Set sleep cycles for ULP coprocessor timer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
