espressif/idf-eclipse-plugin/bundles/com.espressif.idf.debug.gdbjtag.openocd/svd/esp32s2-ulp.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SENS</name>
      <description>SENS Peripheral</description>
      <groupName>SENS</groupName>
      <baseAddress>0x0000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x110</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TOUCH_DONE_INT</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_INACTIVE_INT</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>TOUCH_ACTIVE_INT</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>SARADC1_DONE_INT</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>SARADC2_DONE_INT</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>TSENS_DONE_INT</name>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>SAR_SLAVE_ADDR1</name>
          <description>Configure slave addresses 0-1 of RTC I2C</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR1</name>
              <description>RTC I2C slave address 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR0</name>
              <description>RTC I2C slave address 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MEAS_STATUS</name>
              <bitOffset>22</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR2</name>
          <description>Configure slave addresses 2-3 of RTC I2C</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR3</name>
              <description>RTC I2C slave address 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR2</name>
              <description>RTC I2C slave address 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR3</name>
          <description>Configure slave addresses 4-5 of RTC I2C</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR5</name>
              <description>RTC I2C slave address 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR4</name>
              <description>RTC I2C slave address 4</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_SLAVE_ADDR4</name>
          <description>Configure slave addresses 6-7 of RTC I2C</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>I2C_SLAVE_ADDR7</name>
              <description>RTC I2C slave address 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_SLAVE_ADDR6</name>
              <description>RTC I2C slave address 6</description>
              <bitOffset>11</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_I2C_CTRL</name>
          <description>Configure RTC I2C transmission</description>
          <addressOffset>0x58</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SAR_I2C_CTRL</name>
              <description>RTC I2C control data. Active only when SENS_SAR_I2C_START_FORCE =
1.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START</name>
              <description>Start RTC I2C. Active only when SENS_SAR_I2C_START_FORCE = 1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAR_I2C_START_FORCE</name>
              <description>0: RTC I2C started by FSM. 1: RTC I2C started by software.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_RAW</name>
          <description>Interrupt raw bit of ULP-RISCV</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_RAW</name>
              <description>TOUCH_DONE_INT interrupt raw bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_RAW</name>
              <description>TOUCH_INACTIVE_INT interrupt raw bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_RAW</name>
              <description>TOUCH_ACTIVE_INT interrupt raw bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_RAW</name>
              <description>SARADC1_DONE_INT interrupt raw bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_RAW</name>
              <description>SARADC2_DONE_INT interrupt raw bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_RAW</name>
              <description>TSENS_DONE_INT interrupt raw bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_RAW</name>
              <description>RISCV_START_INT interrupt raw bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_RAW</name>
              <description>SW_INT interrupt raw bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_RAW</name>
              <description>SWD_INT interrupt raw bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ENA</name>
          <description>Interrupt enable bit of ULP-RISCV</description>
          <addressOffset>0x12C</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_ENA</name>
              <description>TOUCH_DONE_INT interrupt enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_ENA</name>
              <description>TOUCH_INACTIVE_INT interrupt enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_ENA</name>
              <description>TOUCH_ACTIVE_INT interrupt enable bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_ENA</name>
              <description>SARADC1_DONE_INT interrupt enable bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ENA</name>
              <description>SARADC2_DONE_INT interrupt enable bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_ENA</name>
              <description>TSENS_DONE_INT interrupt enable bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_START_INT_ENA</name>
              <description>RISCV_START_INT interrupt enable bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SW_INT_ENA</name>
              <description>SW_INT interrupt enable bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_ENA</name>
              <description>SWD_INT interrupt enable bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_ST</name>
          <description>Interrupt status bit of ULP-RISCV</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_ST</name>
              <description>TOUCH_DONE_INT interrupt status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_ST</name>
              <description>TOUCH_INACTIVE_INT interrupt status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_ST</name>
              <description>TOUCH_ACTIVE_INT interrupt status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_ST</name>
              <description>SARADC1_DONE_INT interrupt status bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_ST</name>
              <description>SARADC2_DONE_INT interrupt status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_ST</name>
              <description>TSENS_DONE_INT interrupt status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_ST</name>
              <description>RISCV_START_INT interrupt status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_ST</name>
              <description>SW_INT interrupt status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_ST</name>
              <description>SWD_INT interrupt status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAR_COCPU_INT_CLR</name>
          <description>Interrupt clear bit of ULP-RISCV</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>COCPU_TOUCH_DONE_INT_CLR</name>
              <description>TOUCH_DONE_INT interrupt clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_INACTIVE_INT_CLR</name>
              <description>TOUCH_INACTIVE_INT interrupt clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TOUCH_ACTIVE_INT_CLR</name>
              <description>TOUCH_ACTIVE_INT interrupt clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC1_INT_CLR</name>
              <description>SARADC1_DONE_INT interrupt clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SARADC2_INT_CLR</name>
              <description>SARADC2_DONE_INT interrupt clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_TSENS_INT_CLR</name>
              <description>TSENS_DONE_INT interrupt clear bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_START_INT_CLR</name>
              <description>RISCV_START_INT interrupt clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SW_INT_CLR</name>
              <description>SW_INT interrupt clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>COCPU_SWD_INT_CLR</name>
              <description>SWD_INT interrupt clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>